Revit 2024 API
TableSectionData.InsertColumn Method
 Inserts a new column at the specified index relative to the current set of columns.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public void InsertColumn(
	int index
)
Visual Basic
Public Sub InsertColumn ( _
	index As Integer _
)
Visual C++
public:
void InsertColumn(
	int index
)
Parameters
index
Type: System.Int32
 An integer index.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  index is invalid index.
Autodesk.Revit.Exceptions.InvalidOperationException |  This operation is forbidden for cells in standard schedule body sections.
See Also
TableSectionData Class
Autodesk.Revit.DB Namespace